<?php
 
// จัดให้อยู่ในรูปแบบนี้ ### - #### - ### 
 
// สมมติเบอร์นี้
$mobile = "0859490862" ; 
 
// กำหนดเครื่องหมาย 
$minus_sign = "-" ; 
 
// เริ่มจากซ้ายตัวที่ 1 ( 0 ) ตัดทิ้งขวาทิ้ง 7 ตัวอักษร ได้ 085 
$part1 = substr ( $mobile , 0 , -7 ) ; 
 
// เริ่มจากซ้าย ตัวที่ 4 (9) ตัดทิ้งขวาทิ้ง 3 ตัวอักษร ได้ 9490 
$part2 = substr( $mobile , 3 , -3 ) ; 
 
// เริ่มจากซ้าย ตัวที่ 8 (8) ไม่ตัดขวาทิ้ง ได้ 862 
$part3 = substr( $mobile , 7 ) ; 
 
echo $part1. $minus_sign . $part2 . $minus_sign . $part3 ; 
 
?>